//Copyright (C)2014-2024 GOWIN Semiconductor Corporation.
//All rights reserved.
//File Title: Timing Constraints file
//Tool Version: V1.9.9.01 (64-bit) 
//Created Time: 2024-03-13 14:07:58
create_clock -name clk50m -period 20 -waveform {0 10} [get_ports {clk_50M}]
create_generated_clock -name clk133m145 -source [get_ports {clk_50M}] -master_clock clk50m -divide_by 3 -multiply_by 8 -duty_cycle 50 -phase 135 [get_nets {aux_clk}]
create_generated_clock -name clk133m315 -source [get_ports {clk_50M}] -master_clock clk50m -divide_by 3 -multiply_by 8 -duty_cycle 50 -phase 315 [get_nets {sdram_clk_p}]
create_generated_clock -name clk133m -source [get_ports {clk_50M}] -master_clock clk50m -divide_by 3 -multiply_by 8 -duty_cycle 50 [get_nets {clk_133M}]
set_input_delay -clock clk133m 0.75 -add_delay -source_latency_included [get_ports {sdram_dq[15] sdram_dq[14] sdram_dq[13] sdram_dq[12] sdram_dq[11] sdram_dq[10] sdram_dq[9] sdram_dq[8] sdram_dq[7] sdram_dq[6] sdram_dq[5] sdram_dq[4] sdram_dq[3] sdram_dq[2] sdram_dq[1] sdram_dq[0]}]
//set_false_path -from [get_clocks {clk133m}] -through [get_nets {print_buffer_pointer[0] print_buffer_pointer[1] print_buffer_pointer[2] print_buffer_pointer[3] print_buffer_pointer[4] print_buffer_pointer[5] print_buffer_pointer[6]}] -to [get_regs {print_buffer_1000_s0 print_buffer_1001_s0 print_buffer_1002_s0 print_buffer_1003_s0 print_buffer_1004_s0 print_buffer_1005_s0 print_buffer_1006_s0 print_buffer_1007_s0 print_buffer_1008_s0 print_buffer_1009_s0 print_buffer_1010_s0 print_buffer_1011_s0 print_buffer_1012_s0 print_buffer_1013_s0 print_buffer_1014_s0 print_buffer_1015_s0 print_buffer_1016_s0 print_buffer_1017_s0 print_buffer_1018_s0 print_buffer_1019_s0 print_buffer_1020_s0 print_buffer_1021_s0 print_buffer_1022_s0 print_buffer_1023_s0 print_buffer_872_s0 print_buffer_896_s0 print_buffer_899_s0 print_buffer_905_s0 print_buffer_942_s0 print_buffer_952_s0 print_buffer_953_s0 print_buffer_954_s0 print_buffer_957_s0 print_buffer_958_s0 print_buffer_961_s0 print_buffer_962_s0 print_buffer_964_s0 print_buffer_966_s0 print_buffer_970_s0 print_buffer_971_s0 print_buffer_973_s0 print_buffer_974_s0 print_buffer_976_s0 print_buffer_977_s0 print_buffer_978_s0 print_buffer_979_s0 print_buffer_980_s0 print_buffer_981_s0 print_buffer_982_s0 print_buffer_983_s0 print_buffer_984_s0 print_buffer_985_s0 print_buffer_986_s0 print_buffer_987_s0 print_buffer_988_s0 print_buffer_989_s0 print_buffer_990_s0 print_buffer_991_s0 print_buffer_992_s0 print_buffer_993_s0 print_buffer_994_s0 print_buffer_995_s0 print_buffer_996_s0 print_buffer_997_s0 print_buffer_998_s0 print_buffer_999_s0 print_buffer_pointer_0_s2 print_buffer_pointer_1_s1 print_buffer_pointer_2_s1 print_buffer_pointer_3_s1 print_buffer_pointer_4_s1 print_buffer_pointer_5_s1 print_buffer_pointer_6_s1 print_length_6_s0 print_state_0_s1 print_state_1_s1 print_type_s0}] 
